EDT/УТ/src/Documents/ПриемНаРаботуВОрганизацию/ПриемНаРаботуВОрганизацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботуВОрганизацию</name>
  <registerRecords>InformationRegister.РаботникиОрганизации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетВПроектнойДеятельности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяРольСотрудника</name>
      <type>
        <types>CatalogRef.РолиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеНачисление</name>
      <type>
        <types>CatalogRef.зпНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/УчетБэйджейСотрудников/УчетБэйджейСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетБэйджейСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Бэйдж</name>
    <type>
      <types>CatalogRef.БэйджиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>БэйджАктуален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛичногоТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.зпГруппыФизлиц</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНетМонет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/ПриемНаРаботуВОрганизацию/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//CeHbKA 13.05.2019 #3103
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Терминал = ПараметрыСеанса.ТерминалДоставки;
		Объект.Терминал = ?(Объект.Терминал.Пустая(), Справочники.РегиональныеТерминалы.МоскваСтриж, Объект.Терминал);
	КонецЕсли; 
	//CeHbKA 13.05.2019 #3103
	
КонецПроцедуры

//&НаСервере
//Функция ПолучитьБэйджНаСервере(ТекСотрудник)
//	
//	// ищем бэйдж
//	Запрос = Новый Запрос("ВЫБРАТЬ
//	                      |	БэйджиСотрудников.Ссылка КАК Ссылка,
//	                      |	УчетБэйджейСотрудниковСрезПервых.Сотрудник КАК Сотрудник,
//	                      |	ЕСТЬNULL(УчетБэйджейСотрудниковСрезПервых.БэйджАктуален, ЛОЖЬ) КАК БэйджАктуален
//	                      |ИЗ
//	                      |	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
//	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетБэйджейСотрудников.СрезПервых КАК УчетБэйджейСотрудниковСрезПервых
//	                      |		ПО БэйджиСотрудников.Владелец = УчетБэйджейСотрудниковСрезПервых.Сотрудник
//	                      |ГДЕ
//	                      |	БэйджиСотрудников.Владелец = &Владелец");
//	Запрос.УстановитьПараметр("Владелец", ТекСотрудник);
//	Рез = Запрос.Выполнить().Выбрать();
//	
//	Если Рез.Следующий() Тогда			
//		Если Рез.БэйджАктуален Тогда			
//			
//			Возврат Рез.ссылка;		
//		Иначе
//		    Сообщить("Бэйдж сотрудника более не актуален. ");
//			Возврат Неопределено;	
//		КонецЕсли;				
//	Иначе
//		Сообщить("Нет назначенного бейджа. ");
//		Возврат Неопределено;	
//	КонецЕсли;
//	
//	
//КонецФункции


&НаКлиенте
Процедура ПечатьБэйджей(Команда)
	
	МассивБэйджей = Новый Массив;
	
	Для каждого Чел Из Объект.Сотрудники Цикл
	
		Бэйдж = ПолучитьБэйджНаСервере(Чел.Сотрудник);	
	    Если Бэйдж = Неопределено Тогда	
			//// вопрос о создании бэйджа
			//Парам = Новый Структура("Сотрудник", ТекСотрудник);
			//ТекстВопроса = "Создать и назначить бэйдж на сотрудника " + ТекСотрудник + "?";
			//ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьБэйдж", ЭтотОбъект, Парам), ТекстВопроса, РежимДиалогаВопрос.ДаНет);   
			Бэйдж = mas.СоздатьБэйджСотрудника(Чел.Сотрудник);
		Иначе				
		КонецЕсли;
		МассивБэйджей.Добавить(Бэйдж);
		
	КонецЦикла;
	
	
	Если МассивБэйджей.Количество() Тогда		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент = mas.ПечатьБэйджаГрупповая(МассивБэйджей, ТабличныйДокумент);	
		ТабличныйДокумент.Показать();		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьБэйдж(Парам1, Парам2) Экспорт

	Если Парам1 = КодВозвратаДиалога.Да Тогда 
		Бэйдж = mas.СоздатьБэйджСотрудника(Парам2.Сотрудник);	
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		mas.НапечататьБэйджНаСервере(Бэйдж.Ссылка, ТабличныйДокумент);
		ТабличныйДокумент.Показать();
	Иначе	
	КонецЕсли;
	
КонецПроцедуры

// печать бэйджа
Процедура НапечататьБэйджНаСервере(БэйджСсылка, ТабличныйДокумент)

		
	Макет = Справочники.БэйджиСотрудников.ПолучитьМакет("Бэйдж");
	//ТабличныйДокумент = Новый ТабличныйДокумент;	
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Должность = "";
	Если ТипЗнч(БэйджСсылка.Владелец) = Тип("СправочникСсылка.новаВодители") Тогда		
		Должность = "Водитель";	
	ИначеЕсли ТипЗнч(БэйджСсылка.Владелец) = Тип("СправочникСсылка.новаЭкспедиторы") Тогда	
		Должность = "Экспедитор";	
	КонецЕсли;
	
	ОбластьБэйджа = Макет.ПолучитьОбласть("ОбластьБэйджа");
	
	ОбластьБэйджа.Параметры.ФИО = БэйджСсылка.Владелец.Наименование;		
	ОбластьБэйджа.Параметры.Должность = Должность;
	ОбластьБэйджа.Параметры.Штрихкод = may.ПолучитьШКCode_39(СокрЛП(БэйджСсылка.Код));	

	ТабличныйДокумент.Вывести(ОбластьБэйджа);
	

КонецПроцедуры


Функция ПолучитьБэйджНаСервере(Владелец) Экспорт
	
	// ищем бэйдж
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БэйджиСотрудников.Ссылка КАК Ссылка,
	                      |	УчетБэйджейСотрудниковСрезПервых.Сотрудник КАК Сотрудник,
	                      |	ЕСТЬNULL(УчетБэйджейСотрудниковСрезПервых.БэйджАктуален, ЛОЖЬ) КАК БэйджАктуален
	                      |ИЗ
	                      |	Справочник.БэйджиСотрудников КАК БэйджиСотрудников
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетБэйджейСотрудников.СрезПервых КАК УчетБэйджейСотрудниковСрезПервых
	                      |		ПО БэйджиСотрудников.Владелец = УчетБэйджейСотрудниковСрезПервых.Сотрудник
	                      |ГДЕ
	                      |	БэйджиСотрудников.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда			
		Если Рез.БэйджАктуален Тогда			
			
			Возврат Рез.ссылка;		
		Иначе
		    Сообщить("Бэйдж сотрудника более не актуален: " + Владелец);
			Возврат Неопределено;	
		КонецЕсли;				
	Иначе
		Сообщить("Нет назначенного бейджа: " + Владелец);
		Возврат Неопределено;	
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	//CeHbKA 13.05.2019 #3103	
	ТекСтрока = Элементы.Сотрудники.ТекущиеДанные;
	
	ТекСтрока.ФизЛицо = ПолучитьФизЛицоНаСервере(ТекСтрока.Сотрудник);
	//CeHbKA 13.05.2019 #3103
		
КонецПроцедуры

//CeHbKA 13.05.2019 #3103
&НаСервере
Функция ПолучитьФизЛицоНаСервере(Сотрудник)
	
	Попытка
		Возврат Сотрудник.ФизЛицо;	
	Исключение	
		Возврат Справочники.ФизическиеЛица.ПустаяСсылка();	
	КонецПопытки; 
	
КонецФункции


//CeHbKA 13.05.2019 #3103

//Переварюха В.В. Задача № 3649 07.11.2019
&НаКлиенте
Процедура СотрудникиДолжностьПриИзменении(Элемент)
	
	РольСотрудника = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Должность.РольСотрудника;
	ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.ОсновнаяРольСотрудника = РольСотрудника;
	
КонецПроцедуры
//Переварюха В.В. Задача № 3649 07.11.2019
